const locations ={
    "divisions": [
        {
            "name": "বরিশাল",
            "districts": [
                { "name": "বরগুনা", "upazilas": ["আমতলী", "বামনা", "বরগুনা সদর", "বেতাগী", "পাথরঘাটা", "তালতলী"] },
                { "name": "বরিশাল", "upazilas": ["আগৈলঝারা", "বাবুগঞ্জ", "বাকেরগঞ্জ", "বানারীপাড়া", "গৌরনদী", "হিজলা", "বরিশাল সদর", "মেহেন্দিগঞ্জ", "মুলাদী", "উজিরপুর"] },
                { "name": "ভোলা", "upazilas": ["ভোলা সদর", "বুরহানউদ্দিন", "চর ফ্যাশন", "দৌলতখান", "লালমোহন", "মনপুরা", "তজুমদ্দিন"] },
                { "name": "ঝালকাঠি", "upazilas": ["ঝালকাঠি সদর", "কাঠalia", "নলছিটি", "রাজাপুর"] },
                { "name": "পটুয়াখালী", "upazilas": ["বাউফল", "দশmina", "গলাচিপা", "কলাপাড়া", "মির্জাগঞ্জ", "পটুয়াখালী সদর", "রাঙ্গাবালী", "দুমকি"] },
                { "name": "পিরোজপুর", "upazilas": ["ভান্ডারিয়া", "কাউখালী", "মঠবাড়িয়া", "নাজিরপুর", "পিরোজপুর সদর", "নেছারাবাদ (স্বরূপকাঠী)", "জিয়ানগর"] }
            ]
        },
        {
            "name": "চট্টগ্রাম",
            "districts": [
                { "name": "বান্দরবান", "upazilas": ["আলীকদম", "বান্দরবান সদর", "লামা", "নাইক্ষ্যংছড়ি", "রোয়াংছড়ি", "রুমা", "থানচি"] },
                { "name": "ব্রাহ্মণবাড়িয়া", "upazilas": ["আখাউড়া", "বাঞ্ছারামপুর", "ব্রাহ্মণবাড়িয়া সদর", "কসবা", "নবীনগর", "নাসিরনগর", "সরাইল", "আশুগঞ্জ", "বিজয়নগর"] },
                { "name": "চাঁদপুর", "upazilas": ["চাঁদপুর সদর", "ফরিদগঞ্জ", "হাইমচর", "হাজীগঞ্জ", "কচুয়া", "মতলব দক্ষিণ", "মতলব উত্তর", "শাহরাস্তি"] },
                { "name": "চট্টগ্রাম", "upazilas": ["আনোয়ারা", "বাশখালী", "বোয়ালখালী", "চন্দনাইশ", "ফটিকছড়ি", "হাটহাজারী", "কর্ণফুলী", "লোহাগারা", "মীরসরাই", "পটিয়া", "রাঙ্গুনিয়া", "রাউজান", "সন্দ্বীপ", "সাতকানিয়া", "সীতাকুণ্ড"] },
                { "name": "কুমিল্লা", "upazilas": ["বরুড়া", "ব্রাহ্মণপাড়া", "বুড়িচং", "চান্দিনা", "চৌদ্দগ্রাম", "দাউদকান্দি", "দেবীদ্বার", "হোমনা", "লাকসাম", "মনোহরগঞ্জ", "মেঘনা", "মুরাদনগর", "নাঙ্গলকোট", "কুমিল্লা সদর", "তিতাস", "কুমিল্লা সদর দক্ষিণ"] },
                { "name": "কক্সবাজার", "upazilas": ["চকরিয়া", "কক্সবাজার সদর", "কুতুবদিয়া", "মহেশখালী", "পেকুয়া", "রামু", "টেকনাফ", "উখিয়া"] },
                { "name": "ফেনী", "upazilas": ["ছাগলনাইয়া", "দাগনভূঞা", "ফেনী সদর", "পরশুরাম", "সোনাগাজী", "ফুলগাজী"] },
                { "name": "খাগড়াছড়ি", "upazilas": ["দিঘিনালা", "খাগড়াছড়ি", "লক্ষীছড়ি", "মহালছড়ি", "মানিকছড়ি", "মাটিরাঙ্গা", "পানছড়ি", "রামগড়"] },
                { "name": "লক্ষ্মীপুর", "upazilas": ["কমলনগর", "লক্ষ্মীপুর সদর", "রায়পুর", "রামগঞ্জ", "রামগতি"] },
                { "name": "নোয়াখালী", "upazilas": ["বেগমগঞ্জ", "চাটখিল", "কোম্পানীগঞ্জ", "হাতিয়া", "কবিরহাট", "নোয়াখালী সদর", "সেনবাগ", "সোনাইমুড়ি", "সুবর্ণচর"] },
                { "name": "রাঙ্গামাটি", "upazilas": ["বাঘাইছড়ি", "বarkাল", "কাউখালী (বেতবুনিয়া)", "বেলাইছড়ি", "কাপ্তাই", "জুরাইছড়ি", "লংগadu", "নানিয়ারচর", "রাজস্থলী", "রাঙ্গামাটি সদর"] }
            ]
        },
        {
            "name": "ঢাকা",
            "districts": [
                { "name": "ঢাকা", "upazilas": ["ধামরাই", "দোহার", "কেরাণীগঞ্জ", "নবাবগঞ্জ", "সাভার"] },
                { "name": "ফরিদপুর", "upazilas": ["আলফাডাঙ্গা", "ভাঙ্গা", "বোয়ালমারী", "চরভদ্রাসন", "ফরিদপুর সদর", "মধুখালী", "নগরকান্দা", "সদরপুর", "সালথা"] },
                { "name": "গাজীপুর", "upazilas": ["গাজীপুর সদর", "কালিয়াকৈর", "কালীগঞ্জ", "কাপাসিয়া", "শ্রীপুর"] },
                { "name": "গোপালগঞ্জ", "upazilas": ["গোপালগঞ্জ সদর", "কাশিয়ানী", "কোটালীপাড়া", "মুকসুদপুর", "টুংগীপাড়া"] },
                { "name": "কিশোরগঞ্জ", "upazilas": ["অষ্টগ্রাম", "বাজিতপুর", "ভৈরব", "হোসেনপুর", "ইটনা", "করিমগঞ্জ", "কটিadী", "কিশোরগঞ্জ সদর", "কুলিয়ারচর", "মিঠামইন", "নিকলী", "পাকুন্দিয়া", "তাড়াইল"] },
                { "name": "মাদারীপুর", "upazilas": ["রাজৈর", "মাদারীপুর সদর", "কালকিনি", "শিবচর"] },
                { "name": "মানিকগঞ্জ", "upazilas": ["দৌলতপুর", "ঘিওর", "হরিরামপুর", "মানিকগঞ্জ সদর", "সাটুরিয়া", "শিবালয়", "সিংগাইর"] },
                { "name": "মুন্সীগঞ্জ", "upazilas": ["গজারিয়া", "লৌহজং", "মুন্সীগঞ্জ সদর", "সিরাজদীখান", "শ্রীনগর", "টংগীবাড়ী"] },
                { "name": "নারায়ণগঞ্জ", "upazilas": ["আড়াইহাজার", "বন্দর", "নারায়ণগঞ্জ সদর", "রূপগঞ্জ", "সোনারগাঁ"] },
                { "name": "নরসিংদী", "upazilas": ["বেলাবো", "মনোহরদী", "নরসিংদী সদর", "পলাশ", "রায়পুরা", "শিবপুর"] },
                { "name": "রাজবাড়ী", "upazilas": ["বালিয়াকান্দি", "গোয়ালন্দ", "পাংশা", "রাজবাড়ী সদর", "কালুখালী"] },
                { "name": "শরীয়তপুর", "upazilas": ["ভেদরগঞ্জ", "ডামুড্যা", "গোসাইরহাট", "নড়িয়া", "শরীয়তপুর সদর", "জাজিরা"] },
                { "name": "টাঙ্গাইল", "upazilas": ["গোপালপুর", "বাসাইল", "ভুয়াপুর", "দেলদুয়ার", "ঘাটাইল", "কালিহাতী", "মধুপুর", "মির্জাপুর", "নাগরপুর", "সখিপুর", "ধনবাড়ী", "টাঙ্গাইল সদর"] }
            ]
        },
        {
            "name": "খুলনা",
            "districts": [
                { "name": "বাগেরহাট", "upazilas": ["বাগেরহাট সদর", "চিতলমারী", "ফকিরহাট", "কচুয়া", "মোল্লাহাট", "মোংলা", "মোরেলগঞ্জ", "রামপাল", "শরণখোলা"] },
                { "name": "চুয়াডাঙ্গা", "upazilas": ["আলমডাঙ্গা", "চুয়াডাঙ্গা সদর", "দামুড়হুদা", "জীবননগর"] },
                { "name": "যশোর", "upazilas": ["অভয়নগর", "বাঘেরপাড়া", "চৌগাছা", "ঝিকরগাছা", "কেশবপুর", "যশোর সদর", "মণিরামপুর", "শার্শা"] },
                { "name": "ঝিনাইদহ", "upazilas": ["হরিণাকুণ্ড", "ঝিনাইদহ সদর", "কালীগঞ্জ", "কোটচাঁদপুর", "মহেশপুর", "শৈলকুপা"] },
                { "name": "খুলনা", "upazilas": ["বাটিয়াঘাটা", "দাকোপ", "ডুমুরিয়া", "দিঘলিয়া", "কয়রা", "পাইকগাছা", "ফুলতলা", "রূপসা", "তেরখাদা"] },
                { "name": "কুষ্টিয়া", "upazilas": ["ভেড়ামারা", "দৌলতপুর", "খোকসা", "কুমারখালী", "কুষ্টিয়া সদর", "মির্জাপুর"] },
                { "name": "মাগুরা", "upazilas": ["মাগুরা সদর", "মোহাম্মদপুর", "শালিখা", "শ্রীপুর"] },
                { "name": "মেহেরপুর", "upazilas": ["গাংনী", "মেহেরপুর সদর", "মুজিবনগর"] },
                { "name": "নড়াইল", "upazilas": ["কালিয়া", "লোহাগড়া", "নড়াইল সদর", "নড়াগতি থানা"] },
                { "name": "সাতক্ষীরা", "upazilas": ["আসসুনী", "দেবহাটা", "কলারোয়া", "কালীগঞ্জ", "সাতক্ষীরা সদर", "শ্যামনগর", "তালা"] }
            ]
        },
        {
            "name": "ময়মনসিংহ",
            "districts": [
                { "name": "জামালপুর", "upazilas": ["বকশীগঞ্জ", "দেওয়ানগঞ্জ", "ইসলামপুর", "জামালপুর সদর", "মাদারগঞ্জ", "মেলান্দহ", "সরিষাবাড়ী"] },
                { "name": "ময়মনসিংহ", "upazilas": ["ভালুকা", "ধোবাউরা", "ফুলবাড়িয়া", "গফরগাঁও", "গৌরীপুর", "হালুয়াঘাট", "ঈশ্বরগঞ্জ", "ময়মনসিংহ সদর", "মুক্তাগাছা", "নন্দাইল", "ফুলপুর", "ত্রিশাল", "তারাকান্দা"] },
                { "name": "নেত্রকোণা", "upazilas": ["আটপাড়া", "বারহাট্টা", "দুর্গাপুর", "খালিয়াজুড়ি", "কলমাকান্দা", "কেন্দুয়া", "মদন", "মোহনগঞ্জ", "নেত্রকোণা সদর", "পূর্বধলা"] },
                { "name": "শেরপুর", "upazilas": ["ঝিনাইগাতী", "নকলা", "নালিতাবাড়ী", "শেরপুর সদর", "শ্রীবরদী"] }
            ]
        },
        {
            "name": "রাজশাহী",
            "districts": [
                { "name": "বগুড়া", "upazilas": ["আদমদিঘী", "বগুড়া সদর", "ধুনট", "ধুপচাঁচিয়া", "গাবতলী", "কাহালু", "নন্দীগ্রাম", "সারিয়াকান্দি", "শাজাহানপুর", "শেরপুর", "শিবগঞ্জ", "সোনাতলা"] },
                { "name": "জয়পুরহাট", "upazilas": ["আক্কেলপুর", "জয়পুরহাট সদর", "কালাই", "ক্ষেতলাল", "পাঁচবিবি"] },
                { "name": "নওগাঁ", "upazilas": ["আত্রাই", "বদলগাছী", "মান্দা", "ধামইরহাট", "মহাদেবপুর", "নওগাঁ সদর", "নিয়ামতপুর", "পত্নীতলা", "পোরশা", "রাণীনগর", "সাপাহার"] },
                { "name": "নাটোর", "upazilas": ["বাগাতিপাড়া", "বড়াইগ্রাম", "গুরুদাসপুর", "লালপুর", "নাটোর সদর", "সিংড়া", "নলডাঙ্গা"] },
                { "name": "নবাবগঞ্জ", "upazilas": ["ভোলাহাট", "গোমস্তাপুর", "নাচোল", "নবাবগঞ্জ সদর", "শিবগঞ্জ"] },
                { "name": "পাবনা", "upazilas": ["আটঘরিয়া", "বেড়া", "ভাঙ্গুড়া", "চাটমোহর", "ফরিদপুর", "ঈশ্বরদী", "পাবনা সদর", "সাঁথিয়া", "সুজানগর"] },
                { "name": "রাজশাহী", "upazilas": ["বাঘা", "বাগমারা", "চারঘাট", "দুর্গাপুর", "গোদাগাড়ী", "মোহনপুর", "পবা", "পুঠিয়া", "তানোর"] },
                { "name": "সিরাজগঞ্জ", "upazilas": ["বেলকুচি", "চৌহালি", "কামারখন্দ", "কাজীপুর", "রায়গঞ্জ", "শাহজাদপুর", "সিরাজগঞ্জ সদর", "তাড়াশ", "উল্লাপাড়া"] }
            ]
        },
        {
            "name": "রংপুর",
            "districts": [
                { "name": "দিনাজপুর", "upazilas": ["বিরল", "বিরামপুর", "বীরগঞ্জ", "বোচাগঞ্জ", "চিরিরবন্দর", "ফুলবাড়ী", "ঘোড়াঘাট", "হাকিমপুর", "কাহারোল", "খানসামা", "দিনাজপুর সদর", "নবাবগঞ্জ", "পার্বতীপুর"] },
                { "name": "গাইবান্ধা", "upazilas": ["ফুলছড়ি", "গাইবান্ধা সদর", "গোবিন্দগঞ্জ", "পলাশবাড়ী", "সাদুল্লাপুর", "সাঘাটা", "সুন্দরগঞ্জ"] },
                { "name": "কুড়িগ্রাম", "upazilas": ["ভুরুঙ্গামারী", "চর রাজিবপুর", "চিলমারী", "ফুলবাড়ী", "কুড়িগ্রাম সদর", "নাগেশ্বরী", "রাজারহাট", "রৌমারী", "উলিপুর"] },
                { "name": "লালমনিরহাট", "upazilas": ["আদিতমারী", "হাতীবান্ধা", "কালীগঞ্জ", "লালমনিরহাট সদর", "পাটগ্রাম"] },
                { "name": "নীলফামারী", "upazilas": ["ডিমলা", "ডোমার", "জলঢাকা", "কিশোরগঞ্জ", "নীলফামারী সদর", "সৈয়দপুর"] },
                { "name": "পঞ্চগড়", "upazilas": ["আটোয়ারী", "বোদা", "দেবীগঞ্জ", "পঞ্চগড় সদর", "তেতুলিয়া"] },
                { "name": "রংপুর", "upazilas": ["বদরগঞ্জ", "গঙ্গাচরা", "কাউনিয়া", "রংপুর সদর", "মিঠাপুকুর", "পীরগাছা", "পীরগঞ্জ", "তারাগঞ্জ"] },
                { "name": "ঠাকুরগাঁও", "upazilas": ["বালিয়াডাঙ্গী", "হরিপুর", "পীরগঞ্জ", "রাণীশংকাইল", "ঠাকুরগাঁও সদর"] }
            ]
        },
        {
            "name": "সিলেট",
            "districts": [
                { "name": "হবিগঞ্জ", "upazilas": ["আজমিরীগঞ্জ", "বাহুবল", "বানিয়াচং", "চুনারুঘাট", "হবিগঞ্জ সদর", "লাখাই", "মাধবপুর", "নবীগঞ্জ", "সায়েস্তাগঞ্জ"] },
                { "name": "মৌলভীবাজার", "upazilas": ["বড়লেখা", "জুড়ী", "কমলগঞ্জ", "কুলাউড়া", "মৌলভীবাজার সদর", "রাজনগর", "শ্রীমঙ্গল"] },
                { "name": "সুনামগঞ্জ", "upazilas": ["বিশ্বম্ভরপুর", "ছাতক", "দিরাই", "ধরমপাশা", "দোয়ারাবাজার", "জগন্নাথপুর", "জামালগঞ্জ", "শাল্লা", "সুনামগঞ্জ সদর", "তাহিরপুর", "দক্ষিণ সুনামগঞ্জ"] },
                { "name": "সিলেট", "upazilas": ["বালাগঞ্জ", "বিয়ানীবাজার", "বিশ্বনাথ", "কোম্পানীগঞ্জ", "দক্ষিণ সুরমা", "ফেঞ্চুগঞ্জ", "গোলাপগঞ্জ", "গোয়াইনঘাট", "জৈন্তাপুর", "কানাইঘাট", "ওসমানী নগর", "সিলেট সদর", "জকিগঞ্জ"] }
            ]
        }
    ]
}